test_inlet/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (0   0     0)
    (5   0     0)
    (5   0.1   0)
    (0   0.1   0)
    (0   0     2.9)
    (5   0     2.9)
    (5   0.1   2.9)
    (0   0.1   2.9)
    (0   0     3)
    (5   0     3)
    (5   0.1   3)
    (0   0.1   3)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)   (200 2 110) simpleGrading (1 1 1)
    hex (4 5 6 7 8 9 10 11) (200 2 5) simpleGrading (1 1 1)
);

boundary
(
    leftAndRight
    {
        type wall;
        faces
        (
            (7 4 0 3)
            (2 1 5 6)
        );
    }
    
    frontAndBack
    {
        type empty;
        faces
        (
            (3 2 6 7)
	        (7 6 10 11)
            (0 1 5 4) // unclockwise
	        (4 5 9 8) // un
        );
    }

    hot
    {
        type wall;
        faces
        (
            (0 1 2 3) // un
        );
    }

    cold
    {
        type wall;
        faces
        (
            (11 10 9 8)
        );
    }
    
    inlet
    {
	    type patch;
	    faces
	    (
            (11 8 4 7)	
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (6 5 9 10)
        );
    }
	
);

// ************************************************************************* //
